BackwardStep/Backward-Step/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          112;
        startFace       95760;
    }
    outlet
    {
        type            patch;
        nFaces          152;
        startFace       95872;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          344;
        startFace       96024;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          384;
        startFace       96368;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          96256;
        startFace       96752;
    }
)

// ************************************************************************* //
